[
  {
    "tag": "Federal",
    "year": 1982,
    "name": "Plyler v. Doe",
    "description": "Plyler v. Doe was a landmark Supreme Court case between several unnamed undocumented children and a Texas school district. In 1975, Texas passed Education Code Section 21.031, which denied local school districts any state funding for undocumented children, and a group of children in the Tyler school district sued the superintendent, James Plyler. The Court ruled in favor of the children in the case, shaping the way the U.S. would come to treat the youngest undocumented people seeking a public education in the country."
  },
  {
    "tag": "Federal",
    "year": 1986,
    "name": "Immigration Reform and Control Act (IRCA)",
    "description": "Four years after Plyler, Congress passed a comprehensive legalization bill which offered permanent residence to undocumented people who had been in the country since Jan. 1, 1982, and met certain other requirements. It also included a legalization program with less stringent requirements for agricultural workers. About 2.7 million undocumented immigrants became permanent residents through IRCA."
  },
  {
    "tag": "Federal",
    "year": 1996,
    "name": "The Illegal Immigration Reform and Immigrant Responsibility Act (IIRIRA)",
    "description": "Part of an uptick in enforcement policies, IIRIRA aimed to improve border control by imposing criminal penalties for things like racketeering and alien smuggling. The act also includes employment eligibility verification guidelines and sanctions for employers who fail to follow them."
  },
  {
    "tag": "Federal policy for states",
    "year": 1986,
    "name": "Criminal Alien Program",
    "description": "CAP is the oldest federal program made for adoption and implementation in state and local communities. It creates guidelines for state and local authorities to cooperate with federal immigration officials to remove persons that Immigration and Customs Enforcement (ICE) deems deportable. It was enacted in response to IRCA."
  },
  {
    "tag": "Federal policy for states",
    "year": 2002,
    "name": "287(g)",
    "description": "This federal program follows two basic models: the “jail model,” which greatly resembles Criminal Alien Program, calling for local authorities to assist federal officials in removing deportable individuals; and the “task force model,” which makes immigration status check a part of local police work. Jessica Colotl, one of the undocumented young people we interviewed for this story, was held in detention through the 287(g) program."
  },
  {
    "tag": "Federal policy for states",
    "year": 2007,
    "name": "Secure Communities",
    "description": "Secure Communities calls for the fingerprints of anyone arrested or booked by state or local law enforcement to be checked against federal databases. If an immigration violation shows up, the Department of Homeland Security can issue a “detainer” – a request that the state or local jail hold the individual for a period not to exceed 48 hours over the time they would originally have been released."
  },
  {
    "tag": "Federal policy for states",
    "year": 2014,
    "name": "Priority Enforcement Program",
    "description": "PEP is the newest federal program for state and local levels. In general, it replaces the Secure Communities program’s use of detainers with requests for notification, or requests that ICE be notified of a pending release. However, under PEP, ICE may still issue detainers under special circumstances. Note: Not all state or local authorities have historically honored ICE detainers. San Francisco and Los Angeles generally do not, for example."
  },
  {
    "tag": "Federal policy for states",
    "year": 2012,
    "name": "Deferred Action for Childhood Arrivals (DACA)",
    "description": "This Executive Action provides a two-year grant of deferred action for undocumented individuals who were brought to the U.S. as children. DACA also allows undocumented people to work legally in the United States and grants them a Social Security Number."
  },
  {
    "tag": "Federal policy for states",
    "year": 2014,
    "name": "Deferred Action for Parental Accountability (DAPA)",
    "description": "DAPA and an exapnsion of DACA, in November, increase the length of the deferred action period for DACA recipients from two to three years. It also grants deferred action to certain undocumented parents of American citizens and lawful\npermanent residents under DAPA. Several states have sued the federal government over this action, and a Texas court has issued an order that currently blocks DAPA and the expanded DACA programs from being implemented."
  },
  {
    "tag": "State – Calif.",
    "year": 1997,
    "name": "Proposition 187",
    "description": "Though most of its provisions never took effect, this law would have barred undocumented immigrants from accessing public benefits. It would have kept children out of public school and required state and local government employees to verify the status of people they encountered in their jobs. Many of these provisions were ruled to be unconstitutional in a 1995 court case."
  },
  {
    "tag": "State – Calif.",
    "year": 2001,
    "name": "AB 540",
    "description": "This law offers in-state tuition rates to undocumented students who graduated from a California high school that they attended for three years or more. California is one of 20 states that offers resident rates to undocumented students."
  },
  {
    "tag": "State – Calif.",
    "year": 2011,
    "name": "California Dream Act",
    "description": "Split into two bills, AB 130 and AB 131, the California Dream Act gives undocumented students access to state financial aid."
  },
  {
    "tag": "State – Calif.",
    "year": 2015,
    "name": "AB 60",
    "description": "This bill gives undocumented people in the state of California the ability to obtain a driver’s license."
  },
  {
    "tag": "State – Ariz.",
    "year": 2010,
    "name": "SB 1070",
    "description": "This law sets out state criminal penalties for some violations of federal immigration law. It required state and local Arizona police to check the immigration status of any person they detained or arrested that they reasonably suspected was in the U.S. illegally."
  },
  {
    "tag": "State – Ga.",
    "year": 2011,
    "name": "HB 87",
    "description": "This Georgia law was in many ways modeled after Arizona’s SB 1070. It imposed strict requirements for employment eligibility checks and imposed sanctions on employers that did not follow them."
  }
]
